In [1]:
# !pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [6]:
# !pip install PyMySQL

Requirement already satisfied: PyMySQL in c:\users\aakas\anaconda3\lib\site-packages (1.0.2)

In [2]:
# !pip install mysql.connector

Collecting mysql.connector
  Using cached mysql_connector-2.2.9-cp39-cp39-win_amd64.whl
Installing collected packages: mysql.connector
Successfully installed mysql.connector-2.2.9

In [1]:
import pymysql
import pandas as pd
from getpass import getpass

In [2]:
password = getpass("Enter Password : ")
ct = pymysql.connect(host='localhost',port=int(3306),user='root',passwd=password,db='dbbook')

Enter Password : ········

In [3]:
Tables_Names = pd.read_sql_query('show tables',ct)
Tables_Names

   Tables_in_dbbook
0           advisor
1         classroom
2            course
3        department
4        instructor
5            prereq
6           section
7           student
8             takes
9           teaches
10        time_slot

In [6]:
a = list(Tables_Names["Tables_in_dbbook"])
a

['advisor',
 'classroom',
 'course',
 'department',
 'instructor',
 'prereq',
 'section',
 'student',
 'takes',
 'teaches',
 'time_slot']

In [7]:
Tables_With_Values = {}
for i in a:
    Tables_With_Values[i] = pd.DataFrame()
Tables_With_Values

{'advisor': Empty DataFrame
 Columns: []
 Index: [],
 'classroom': Empty DataFrame
 Columns: []
 Index: [],
 'course': Empty DataFrame
 Columns: []
 Index: [],
 'department': Empty DataFrame
 Columns: []
 Index: [],
 'instructor': Empty DataFrame
 Columns: []
 Index: [],
 'prereq': Empty DataFrame
 Columns: []
 Index: [],
 'section': Empty DataFrame
 Columns: []
 Index: [],
 'student': Empty DataFrame
 Columns: []
 Index: [],
 'takes': Empty DataFrame
 Columns: []
 Index: [],
 'teaches': Empty DataFrame
 Columns: []
 Index: [],
 'time_slot': Empty DataFrame
 Columns: []
 Index: []}

In [8]:
for i in range(len(a)):
    Tables_With_Values[a[i]] =pd.read_sql_query(f'select * from {a[i]}',ct)
Tables_With_Values

{'advisor':        s_ID   i_ID
 0     11101  14365
 1     13403  14365
 2     16993  14365
 3      1827  14365
 4     19362  14365
 ...     ...    ...
 1995  96067  99052
 1996  96193  99052
 1997  97868  99052
 1998  98940  99052
 1999  99348  99052

 [2000 rows x 2 columns],
 'classroom':      building room_number  capacity
 0      Alumni         143      47.0
 1      Alumni         547      26.0
 2    Bronfman         700      12.0
 3    Chandler         375      10.0
 4    Chandler         804      11.0
 5       Drown         757      18.0
 6   Fairchild         145      27.0
 7    Garfield         119      59.0
 8       Gates         314      10.0
 9       Gates         707      65.0
 10      Grace          40      34.0
 11    Lambeau         348      51.0
 12  Lamberton         134      10.0
 13  Lamberton         143      10.0
 14       Main         425      22.0
 15       Main          45      30.0
 16     Nassau          45      92.0
 17    Painter          86      97.0
 18      Polya         808      28.0
 19      Power         717      12.0
 20      Power         972      10.0
 21   Rathbone         261      60.0
 22     Saucon         113     109.0
 23     Saucon         180      15.0
 24     Saucon         844      24.0
 25    Stabler         105     113.0
 26     Taylor         183      71.0
 27     Taylor         812     115.0
 28    Whitman         134     120.0
 29    Whitman         434      32.0,
 'course':     course_id                               title   dept_name  credits
 0         101  Diffusion and Phase Transformation  Mech. Eng.      3.0
 1         105                    Image Processing   Astronomy      3.0
 2         123              Differential Equations  Mech. Eng.      3.0
 3         127                      Thermodynamics     Geology      3.0
 4         130               Differential Geometry     Physics      3.0
 ..        ...                                 ...         ...      ...
 195       974                        Astronautics  Accounting      3.0
 196       983                            Virology   Languages      4.0
 197       984                    Music of the 50s     History      3.0
 198       991              Transaction Processing  Psychology      3.0
 199       998                          Immunology  Civil Eng.      4.0

 [200 rows x 4 columns],
 'department':       dept_name     building     budget
 0    Accounting       Saucon  441840.92
 1     Astronomy       Taylor  617253.94
 2     Athletics     Bronfman  734550.70
 3       Biology  Candlestick  647610.55
 4    Civil Eng.     Chandler  255041.46
 5    Comp. Sci.    Lamberton  106378.69
 6   Cybernetics       Mercer  794541.46
 7    Elec. Eng.         Main  276527.61
 8       English       Palmer  611042.66
 9       Finance  Candlestick  866831.75
 10      Geology       Palmer  406557.93
 11      History       Taylor  699140.86
 12    Languages    Linderman  601283.60
 13    Marketing      Lambeau  210627.58
 14         Math     Brodhead  777605.11
 15   Mech. Eng.        Rauch  520350.65
 16      Physics      Wrigley  942162.76
 17    Pol. Sci.      Whitman  573745.09
 18   Psychology     Thompson  848175.04
 19   Statistics       Taylor  395051.74,
 'instructor':        ID               name    dept_name     salary
 0   14365              Lembr   Accounting   32241.56
 1   15347               Bawa    Athletics   72140.88
 2   16807              Yazdi    Athletics   98333.65
 3   19368            Wieland    Pol. Sci.  124651.41
 4   22591          DAgostino   Psychology   59706.49
 5   25946              Liley    Languages   90891.69
 6   28097               Kean      English   35023.18
 7   28400          Atanassov   Statistics   84982.92
 8   31955            Moreira   Accounting   71351.42
 9    3199         Gustafsson   Elec. Eng.   82534.37
 10   3335           Bourrier   Comp. Sci.   80797.83
 11  34175              Bondi   Comp. Sci.  115469.11
 12  35579  Soisalon-Soininen   Psychology   62579.61
 13  36897             Morris    Marketing   43770.36
 14  37687              Arias   Statistics  104563.38
 15   4034             Murata    Athletics   61387.56
 16  41930               Tung    Athletics   50482.03
 17   4233                Luo      English   88791.45
 18  42782          Vicentino   Elec. Eng.   34272.67
 19  43779             Romero    Astronomy   79070.08
 20  48507               Lent   Mech. Eng.  107978.47
 21  48570             Sarkar    Pol. Sci.   87549.80
 22  50330            Shuming      Physics  108011.81
 23  50885     Konstantinides    Languages   32570.50
 24  52647          Bancilhon    Pol. Sci.   87958.01
 25  57180                Hau   Accounting   43966.29
 26  58558           Dusserre    Marketing   66143.25
 27  59795              Desyl    Languages   48803.38
 28  63287             Jaekel    Athletics  103146.87
 29  63395           McKinnon  Cybernetics   94333.99
 30  64871          Gutierrez   Statistics   45310.53
 31   6569             Mingoz      Finance  105311.38
 32  65931            Pimenta  Cybernetics   79866.95
 33  72553                Yin      English   46397.59
 34  73623           Sullivan   Elec. Eng.   90038.09
 35  74420           Voronina      Physics  121141.99
 36  74426              Kenje    Marketing  106554.73
 37  77346            Mahmoud      Geology   99382.59
 38  78699              Pingr   Statistics   59303.62
 39  79081            Ullman    Accounting   47307.10
 40  79653             Levine   Elec. Eng.   89805.83
 41  80759            Queiroz      Biology   45538.32
 42  81991           Valtchev      Biology   77036.18
 43  90376             Bietzk  Cybernetics  117836.50
 44  90643              Choll   Statistics   57807.09
 45  95030              Arinb   Statistics   54805.11
 46  95709            Sakurai      English  118143.98
 47  96895               Mird    Marketing  119921.41
 48  97302          Bertolino   Mech. Eng.   51647.57
 49  99052               Dale  Cybernetics   93348.83,
 'prereq':    course_id prereq_id
 0        696       101
 1        612       123
 2        795       123
 3        376       130
 4        558       130
 ..       ...       ...
 95       972       958
 96       810       966
 97       958       969
 98       236       984
 99       663       998

 [100 rows x 2 columns],
 'section':    course_id sec_id semester    year   building room_number time_slot_id
 0        105      1     Fall  2009.0   Chandler         375            C
 1        105      2     Fall  2002.0     Taylor         183            C
 2        137      1   Spring  2002.0  Fairchild         145            I
 3        158      1     Fall  2008.0    Whitman         434            F
 4        158      2   Spring  2008.0     Taylor         812            D
 ..       ...    ...      ...     ...        ...         ...          ...
 95       960      2     Fall  2006.0      Power         717            M
 96       962      1   Spring  2008.0     Nassau          45            L
 97       972      1   Spring  2009.0     Taylor         183            J
 98       974      1     Fall  2003.0      Polya         808            H
 99       991      1   Spring  2008.0  Lamberton         134            J

 [100 rows x 7 columns],
 'student':          ID       name   dept_name  tot_cred
 0      1000     Manber  Civil Eng.      39.0
 1     10033      Zelty  Mech. Eng.      60.0
 2     10076       Duan  Civil Eng.     105.0
 3      1018      Colin  Civil Eng.      81.0
 4     10204  Mediratta     Geology     112.0
 ...     ...        ...         ...       ...
 1995  99775      Epley   Athletics     116.0
 1996  99780      Bravo     English     100.0
 1997   9993        Won        Math      40.0
 1998  99949       Samo   Astronomy     125.0
 1999  99977    Englund  Psychology      93.0

 [2000 rows x 4 columns],
 'takes':           ID course_id sec_id semester    year grade
 0       1000       239      1     Fall  2006.0    C
 1       1000       319      1   Spring  2003.0    B+
 2       1000       362      1     Fall  2005.0    B+
 3       1000       493      1   Spring  2010.0    A-
 4       1000       571      1   Spring  2004.0    C+
 ...      ...       ...    ...      ...     ...   ...
 29995  99977       791      1   Spring  2006.0    A+
 29996  99977       795      1   Spring  2004.0    C+
 29997  99977       802      1   Spring  2003.0    A-
 29998  99977       867      1     Fall  2006.0    A+
 29999  99977       960      1     Fall  2009.0    A

 [30000 rows x 6 columns],
 'teaches':        ID course_id sec_id semester    year
 0   43779       105      1     Fall  2009.0
 1   43779       105      2     Fall  2002.0
 2    6569       137      1   Spring  2002.0
 3   90376       158      1     Fall  2008.0
 4   99052       158      2   Spring  2008.0
 ..    ...       ...    ...      ...     ...
 95  95709       960      2     Fall  2006.0
 96  22591       962      1   Spring  2008.0
 97  22591       972      1   Spring  2009.0
 98  79081       974      1     Fall  2003.0
 99  22591       991      1   Spring  2008.0

 [100 rows x 5 columns],
 'time_slot':    time_slot_id day  start_hr  start_min  end_hr  end_min
 0             A   F       8.0        0.0     8.0     50.0
 1             A   M       8.0        0.0     8.0     50.0
 2             A   W       8.0        0.0     8.0     50.0
 3             B   F       9.0        0.0     9.0     50.0
 4             B   M       9.0        0.0     9.0     50.0
 5             B   W       9.0        0.0     9.0     50.0
 6             C   F      11.0        0.0    11.0     50.0
 7             C   M      11.0        0.0    11.0     50.0
 8             C   W      11.0        0.0    11.0     50.0
 9             D   F      13.0        0.0    13.0     50.0
 10            D   M      13.0        0.0    13.0     50.0
 11            D   W      13.0        0.0    13.0     50.0
 12            E   R      10.0       30.0    11.0     45.0
 13            E   T      10.0       30.0    11.0     45.0
 14            F   R      14.0       30.0    15.0     45.0
 15            F   T      14.0       30.0    15.0     45.0
 16            G   F      16.0        0.0    16.0     50.0
 17            G   M      16.0        0.0    16.0     50.0
 18            G   W      16.0        0.0    16.0     50.0
 19            H   W      10.0        0.0    12.0     30.0}

In [17]:
for i in range(len(a)):
    Tables_With_Values[a[i]].to_csv(f'D:\\Aakash Nadupalli\\MCA\\MCA 2021 Textbooks\\1st Semester\\Database Systems\\Database System Concepts Code Files\\Tables Csv Files\\{a[i]}.csv',index=False)

In [25]:
print("Number of Records in Each Table :")
for i in range(len(a)):
    print(f"{a[i]}:",len(Tables_With_Values[a[i]]))

Number of Records in Each Table :
advisor: 2000
classroom: 30
course: 200
department: 20
instructor: 50
prereq: 100
section: 100
student: 2000
takes: 30000
teaches: 100
time_slot: 20

In [53]:
for i in range(len(a)):
    print(f"{a[i]} :",Tables_With_Values[a[i]].columns)

advisor : Index(['s_ID', 'i_ID'], dtype='object')
classroom : Index(['building', 'room_number', 'capacity'], dtype='object')
course : Index(['course_id', 'title', 'dept_name', 'credits'], dtype='object')
department : Index(['dept_name', 'building', 'budget'], dtype='object')
instructor : Index(['ID', 'name', 'dept_name', 'salary'], dtype='object')
prereq : Index(['course_id', 'prereq_id'], dtype='object')
section : Index(['course_id', 'sec_id', 'semester', 'year', 'building', 'room_number',
       'time_slot_id'],
      dtype='object')
student : Index(['ID', 'name', 'dept_name', 'tot_cred'], dtype='object')
takes : Index(['ID', 'course_id', 'sec_id', 'semester', 'year', 'grade'], dtype='object')
teaches : Index(['ID', 'course_id', 'sec_id', 'semester', 'year'], dtype='object')
time_slot : Index(['time_slot_id', 'day', 'start_hr', 'start_min', 'end_hr', 'end_min'], dtype='object')

In [87]:
pd.read_sql_query("Select dept_name,sum(tot_cred) as Sum_of_Credits from student group by dept_name",ct)

      dept_name  Sum_of_Credits
0    Accounting          5845.0
1     Astronomy          7141.0
2     Athletics          6494.0
3       Biology          7034.0
4    Civil Eng.          7673.0
5    Comp. Sci.          7098.0
6   Cybernetics          6058.0
7    Elec. Eng.          6378.0
8       English          6479.0
9       Finance          6439.0
10      Geology          6482.0
11      History          8387.0
12    Languages          7222.0
13    Marketing          5579.0
14         Math          6263.0
15   Mech. Eng.          6643.0
16      Physics          6437.0
17    Pol. Sci.          7073.0
18   Psychology          6187.0
19   Statistics          5894.0

In [89]:
pd.read_sql_query("Select max(a.Sum) as Highest_Credits from (Select dept_name,sum(tot_cred) as Sum from student group by dept_name) as a",ct)

   Highest_Credits
0           8387.0

In [92]:
pd.read_sql_query("Select a.dept_name,max(a.Sum) as Highest_Credits from (Select dept_name,sum(tot_cred) as Sum from student group by dept_name) as a  where a.Sum = (Select max(a.Sum) as Highest_Credits from (Select dept_name,sum(tot_cred) as Sum from student group by dept_name) as a)",ct)

    dept_name  Highest_Credits
0  Accounting           8387.0

In [41]:
int(Tables_With_Values[a[0]]['s_ID'][0]) + int(Tables_With_Values[a[0]]['i_ID'][0])

25466

In [85]:
pd.read_sql_query("select max(tot_cred) from student",ct)

   max(tot_cred)
0          129.0

In [86]:
pd.read_sql_query("select a.dept_name,max(a.tot_cred) as Highest_Credits from (Select dept_name,tot_cred from student group by dept_name) as a where a.tot_cred = 128 ",ct)

  dept_name  Highest_Credits
0   Physics            128.0